MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA705/mcu.h
extern volatile IOCPDBBITS IOCPDBbits __attribute__((__sfr__));

#define TRISC TRISC
extern volatile uint16_t TRISC __attribute__((__sfr__));
typedef struct tagTRISCBITS {
  uint16_t TRISC0:1;
  uint16_t TRISC1:1;
  uint16_t TRISC2:1;
  uint16_t TRISC3:1;
  uint16_t TRISC4:1;
  uint16_t TRISC5:1;
  uint16_t TRISC6:1;
  uint16_t TRISC7:1;
  uint16_t TRISC8:1;
  uint16_t TRISC9:1;
} TRISCBITS;
extern volatile TRISCBITS TRISCbits __attribute__((__sfr__));

#define PORTC PORTC
extern volatile uint16_t PORTC __attribute__((__sfr__));
typedef struct tagPORTCBITS {
  uint16_t RC0:1;
  uint16_t RC1:1;
  uint16_t RC2:1;
  uint16_t RC3:1;
  uint16_t RC4:1;
  uint16_t RC5:1;
  uint16_t RC6:1;
  uint16_t RC7:1;
  uint16_t RC8:1;
  uint16_t RC9:1;
} PORTCBITS;
extern volatile PORTCBITS PORTCbits __attribute__((__sfr__));

#define LATC LATC
extern volatile uint16_t LATC __attribute__((__sfr__));
typedef struct tagLATCBITS {
  uint16_t LATC0:1;
  uint16_t LATC1:1;
  uint16_t LATC2:1;
  uint16_t LATC3:1;
  uint16_t LATC4:1;
  uint16_t LATC5:1;
  uint16_t LATC6:1;
  uint16_t LATC7:1;
  uint16_t LATC8:1;
  uint16_t LATC9:1;
} LATCBITS;
extern volatile LATCBITS LATCbits __attribute__((__sfr__));

#define ODCC ODCC
extern volatile uint16_t ODCC __attribute__((__sfr__));
typedef struct tagODCCBITS {
  uint16_t ODCC0:1;
  uint16_t ODCC1:1;
  uint16_t ODCC2:1;
  uint16_t ODCC3:1;
  uint16_t ODCC4:1;
  uint16_t ODCC5:1;
  uint16_t ODCC6:1;
  uint16_t ODCC7:1;
  uint16_t ODCC8:1;
  uint16_t ODCC9:1;
} ODCCBITS;
extern volatile ODCCBITS ODCCbits __attribute__((__sfr__));

#define ANSC ANSC
extern volatile uint16_t ANSC __attribute__((__sfr__));
__extension__ typedef struct tagANSCBITS {
  union {
    struct {
      uint16_t ANSC0:1;
      uint16_t ANSC1:1;
      uint16_t ANSC2:1;
      uint16_t ANSC3:1;
    };
    struct {
      uint16_t ANSELC0:1;
      uint16_t ANSELC1:1;
      uint16_t ANSELC2:1;
      uint16_t ANSELC3:1;
    };
  };
} ANSCBITS;
extern volatile ANSCBITS ANSCbits __attribute__((__sfr__));

#define ANSELC ANSELC
extern volatile uint16_t ANSELC __attribute__((__sfr__));
__extension__ typedef struct tagANSELCBITS {
  union {
    struct {
      uint16_t ANSC0:1;
      uint16_t ANSC1:1;
      uint16_t ANSC2:1;
      uint16_t ANSC3:1;
    };
    struct {
      uint16_t ANSELC0:1;
      uint16_t ANSELC1:1;
      uint16_t ANSELC2:1;
      uint16_t ANSELC3:1;
    };
  };
} ANSELCBITS;
extern volatile ANSELCBITS ANSELCbits __attribute__((__sfr__));

#define IOCPC IOCPC
extern volatile uint16_t IOCPC __attribute__((__sfr__));
typedef struct tagIOCPCBITS {
  uint16_t IOCPC0:1;
  uint16_t IOCPC1:1;
  uint16_t IOCPC2:1;
  uint16_t IOCPC3:1;
  uint16_t IOCPC4:1;
  uint16_t IOCPC5:1;
  uint16_t IOCPC6:1;
  uint16_t IOCPC7:1;
  uint16_t IOCPC8:1;
  uint16_t IOCPC9:1;
} IOCPCBITS;
extern volatile IOCPCBITS IOCPCbits __attribute__((__sfr__));

#define IOCNC IOCNC
extern volatile uint16_t IOCNC __attribute__((__sfr__));
typedef struct tagIOCNCBITS {
  uint16_t IOCNC0:1;
  uint16_t IOCNC1:1;
  uint16_t IOCNC2:1;
  uint16_t IOCNC3:1;
  uint16_t IOCNC4:1;
  uint16_t IOCNC5:1;
  uint16_t IOCNC6:1;
  uint16_t IOCNC7:1;
  uint16_t IOCNC8:1;
  uint16_t IOCNC9:1;
} IOCNCBITS;
extern volatile IOCNCBITS IOCNCbits __attribute__((__sfr__));

#define IOCFC IOCFC
extern volatile uint16_t IOCFC __attribute__((__sfr__));
typedef struct tagIOCFCBITS {
  uint16_t IOCFC0:1;
  uint16_t IOCFC1:1;
  uint16_t IOCFC2:1;
  uint16_t IOCFC3:1;
  uint16_t IOCFC4:1;
  uint16_t IOCFC5:1;
  uint16_t IOCFC6:1;
  uint16_t IOCFC7:1;
  uint16_t IOCFC8:1;
  uint16_t IOCFC9:1;
} IOCFCBITS;
extern volatile IOCFCBITS IOCFCbits __attribute__((__sfr__));

#define CNPUC CNPUC
extern volatile uint16_t CNPUC __attribute__((__sfr__));
__extension__ typedef struct tagCNPUCBITS {
  union {
    struct {
      uint16_t IOCPC0:1;
      uint16_t IOCPC1:1;
      uint16_t IOCPC2:1;
      uint16_t IOCPC3:1;
      uint16_t IOCPC4:1;
      uint16_t IOCPC5:1;
      uint16_t IOCPC6:1;
      uint16_t IOCPC7:1;
      uint16_t IOCPC8:1;
      uint16_t IOCPC9:1;
    };
    struct {
      uint16_t IOCPUC0:1;
      uint16_t IOCPUC1:1;
      uint16_t IOCPUC2:1;
      uint16_t IOCPUC3:1;
      uint16_t IOCPUC4:1;
      uint16_t IOCPUC5:1;
      uint16_t IOCPUC6:1;
      uint16_t IOCPUC7:1;
      uint16_t IOCPUC8:1;
      uint16_t IOCPUC9:1;
    };
    struct {
      uint16_t CNPUC0:1;
      uint16_t CNPUC1:1;
      uint16_t CNPUC2:1;
      uint16_t CNPUC3:1;
      uint16_t CNPUC4:1;
      uint16_t CNPUC5:1;
      uint16_t CNPUC6:1;
      uint16_t CNPUC7:1;
      uint16_t CNPUC8:1;
      uint16_t CNPUC9:1;
    };
  };
} CNPUCBITS;
extern volatile CNPUCBITS CNPUCbits __attribute__((__sfr__));

#define IOCPUC IOCPUC
extern volatile uint16_t IOCPUC __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUCBITS {
  union {
    struct {
      uint16_t IOCPC0:1;
      uint16_t IOCPC1:1;
      uint16_t IOCPC2:1;
      uint16_t IOCPC3:1;
      uint16_t IOCPC4:1;
      uint16_t IOCPC5:1;
      uint16_t IOCPC6:1;
      uint16_t IOCPC7:1;
      uint16_t IOCPC8:1;
      uint16_t IOCPC9:1;
    };
    struct {
      uint16_t IOCPUC0:1;
      uint16_t IOCPUC1:1;
      uint16_t IOCPUC2:1;
      uint16_t IOCPUC3:1;
      uint16_t IOCPUC4:1;
      uint16_t IOCPUC5:1;
      uint16_t IOCPUC6:1;
      uint16_t IOCPUC7:1;
      uint16_t IOCPUC8:1;
      uint16_t IOCPUC9:1;
    };
    struct {
      uint16_t CNPUC0:1;
      uint16_t CNPUC1:1;
      uint16_t CNPUC2:1;
      uint16_t CNPUC3:1;
      uint16_t CNPUC4:1;
      uint16_t CNPUC5:1;
      uint16_t CNPUC6:1;
      uint16_t CNPUC7:1;
      uint16_t CNPUC8:1;
      uint16_t CNPUC9:1;
    };
  };
} IOCPUCBITS;
extern volatile IOCPUCBITS IOCPUCbits __attribute__((__sfr__));

#define CNPDC CNPDC
extern volatile uint16_t CNPDC __attribute__((__sfr__));
__extension__ typedef struct tagCNPDCBITS {
  union {
    struct {
      uint16_t IOCPDC0:1;
      uint16_t IOCPDC1:1;
      uint16_t IOCPDC2:1;
      uint16_t IOCPDC3:1;
      uint16_t IOCPDC4:1;
      uint16_t IOCPDC5:1;
      uint16_t IOCPDC6:1;
      uint16_t IOCPDC7:1;
      uint16_t IOCPDC8:1;
      uint16_t IOCPDC9:1;
    };
    struct {
      uint16_t CNPDC0:1;
      uint16_t CNPDC1:1;
      uint16_t CNPDC2:1;
      uint16_t CNPDC3:1;
      uint16_t CNPDC4:1;
      uint16_t CNPDC5:1;
      uint16_t CNPDC6:1;
      uint16_t CNPDC7:1;
      uint16_t CNPDC8:1;
      uint16_t CNPDC9:1;
    };
  };
} CNPDCBITS;
extern volatile CNPDCBITS CNPDCbits __attribute__((__sfr__));

#define IOCPDC IOCPDC
extern volatile uint16_t IOCPDC __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDCBITS {
  union {
    struct {
      uint16_t IOCPDC0:1;
      uint16_t IOCPDC1:1;
      uint16_t IOCPDC2:1;
      uint16_t IOCPDC3:1;
      uint16_t IOCPDC4:1;
      uint16_t IOCPDC5:1;
      uint16_t IOCPDC6:1;
      uint16_t IOCPDC7:1;
      uint16_t IOCPDC8:1;
      uint16_t IOCPDC9:1;
    };
    struct {
      uint16_t CNPDC0:1;
      uint16_t CNPDC1:1;
      uint16_t CNPDC2:1;
      uint16_t CNPDC3:1;
      uint16_t CNPDC4:1;
      uint16_t CNPDC5:1;
      uint16_t CNPDC6:1;
      uint16_t CNPDC7:1;
      uint16_t CNPDC8:1;
      uint16_t CNPDC9:1;
    };
  };
} IOCPDCBITS;
extern volatile IOCPDCBITS IOCPDCbits __attribute__((__sfr__));

#define ADC1BUF0 ADC1BUF0
extern volatile uint16_t ADC1BUF0 __attribute__((__sfr__));
#define ADC1BUF1 ADC1BUF1
extern volatile uint16_t ADC1BUF1 __attribute__((__sfr__));
#define ADC1BUF2 ADC1BUF2
extern volatile uint16_t ADC1BUF2 __attribute__((__sfr__));
#define ADC1BUF3 ADC1BUF3
extern volatile uint16_t ADC1BUF3 __attribute__((__sfr__));
#define ADC1BUF4 ADC1BUF4
extern volatile uint16_t ADC1BUF4 __attribute__((__sfr__));
#define ADC1BUF5 ADC1BUF5
extern volatile uint16_t ADC1BUF5 __attribute__((__sfr__));
#define ADC1BUF6 ADC1BUF6
extern volatile uint16_t ADC1BUF6 __attribute__((__sfr__));
#define ADC1BUF7 ADC1BUF7
extern volatile uint16_t ADC1BUF7 __attribute__((__sfr__));
#define ADC1BUF8 ADC1BUF8
extern volatile uint16_t ADC1BUF8 __attribute__((__sfr__));
#define ADC1BUF9 ADC1BUF9
extern volatile uint16_t ADC1BUF9 __attribute__((__sfr__));
#define ADC1BUF10 ADC1BUF10
extern volatile uint16_t ADC1BUF10 __attribute__((__sfr__));
#define ADC1BUF11 ADC1BUF11
extern volatile uint16_t ADC1BUF11 __attribute__((__sfr__));
#define ADC1BUF12 ADC1BUF12
extern volatile uint16_t ADC1BUF12 __attribute__((__sfr__));
#define ADC1BUF13 ADC1BUF13
extern volatile uint16_t ADC1BUF13 __attribute__((__sfr__));
#define ADC1BUF14 ADC1BUF14
extern volatile uint16_t ADC1BUF14 __attribute__((__sfr__));
#define ADC1BUF15 ADC1BUF15
extern volatile uint16_t ADC1BUF15 __attribute__((__sfr__));
#define AD1CON1 AD1CON1
extern volatile uint16_t AD1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON1BITS {
  union {
    struct {
      uint16_t DONE:1;
      uint16_t SAMP:1;
      uint16_t ASAM:1;
      uint16_t :1;
      uint16_t SSRC:4;
      uint16_t FORM:2;
      uint16_t MODE12:1;
      uint16_t DMAEN:1;
      uint16_t DMABM:1;
      uint16_t ADSIDL:1;
      uint16_t :1;
      uint16_t ADON:1;
    };
    struct {
      uint16_t :4;
      uint16_t SSRC0:1;
      uint16_t SSRC1:1;
      uint16_t SSRC2:1;
      uint16_t SSRC3:1;
      uint16_t FORM0:1;
      uint16_t FORM1:1;
    };
  };
} AD1CON1BITS;
extern volatile AD1CON1BITS AD1CON1bits __attribute__((__sfr__));

#define AD1CON2 AD1CON2
extern volatile uint16_t AD1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON2BITS {
  union {
    struct {
      uint16_t ALTS:1;
      uint16_t BUFM:1;
      uint16_t SMPI:5;
      uint16_t BUFS:1;
      uint16_t :2;
      uint16_t CSCNA:1;
      uint16_t BUFREGEN:1;
      uint16_t :1;
      uint16_t NVCFG0:1;
      uint16_t PVCFG:2;
    };
    struct {
      uint16_t :2;
      uint16_t SMPI0:1;
      uint16_t SMPI1:1;
      uint16_t SMPI2:1;
      uint16_t SMPI3:1;
      uint16_t SMPI4:1;
      uint16_t :7;
      uint16_t PCVFG0:1;
      uint16_t PCVFG1:1;
    };
  };
} AD1CON2BITS;
extern volatile AD1CON2BITS AD1CON2bits __attribute__((__sfr__));

#define AD1CON3 AD1CON3
extern volatile uint16_t AD1CON3 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON3BITS {
  union {
    struct {
      uint16_t ADCS:8;
      uint16_t SAMC:5;
      uint16_t PUMPEN:1;
      uint16_t EXTSAM:1;
      uint16_t ADRC:1;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t ADCS7:1;
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
    };
  };
} AD1CON3BITS;
extern volatile AD1CON3BITS AD1CON3bits __attribute__((__sfr__));

#define AD1CHS AD1CHS
extern volatile uint16_t AD1CHS __attribute__((__sfr__));
__extension__ typedef struct tagAD1CHSBITS {
  union {
    struct {
      uint16_t CH0SA:5;
      uint16_t CH0NA:3;
      uint16_t CH0SB:5;
      uint16_t CH0NB:3;
    };
    struct {
      uint16_t CH0SA0:1;
      uint16_t CH0SA1:1;
      uint16_t CH0SA2:1;
      uint16_t CH0SA3:1;
      uint16_t CH0SA4:1;
      uint16_t CH0NA0:1;
      uint16_t CH0NA1:1;
      uint16_t CH0NA2:1;
      uint16_t CH0SB0:1;
      uint16_t CH0SB1:1;
      uint16_t CH0SB2:1;
      uint16_t CH0SB3:1;
      uint16_t CH0SB4:1;
      uint16_t CH0NB0:1;
      uint16_t CH0NB1:1;
      uint16_t CH0NB2:1;
    };
  };
} AD1CHSBITS;
extern volatile AD1CHSBITS AD1CHSbits __attribute__((__sfr__));

#define AD1CHS0 AD1CHS0
extern volatile uint16_t AD1CHS0 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CHS0BITS {
  union {
    struct {
      uint16_t CH0SA:5;
      uint16_t CH0NA:3;
      uint16_t CH0SB:5;
      uint16_t CH0NB:3;
    };
    struct {
      uint16_t CH0SA0:1;
      uint16_t CH0SA1:1;
      uint16_t CH0SA2:1;
      uint16_t CH0SA3:1;
      uint16_t CH0SA4:1;
      uint16_t CH0NA0:1;
      uint16_t CH0NA1:1;
      uint16_t CH0NA2:1;
      uint16_t CH0SB0:1;
      uint16_t CH0SB1:1;
      uint16_t CH0SB2:1;
      uint16_t CH0SB3:1;
      uint16_t CH0SB4:1;
      uint16_t CH0NB0:1;
      uint16_t CH0NB1:1;
      uint16_t CH0NB2:1;
    };
  };
} AD1CHS0BITS;
extern volatile AD1CHS0BITS AD1CHS0bits __attribute__((__sfr__));

#define AD1CSSH AD1CSSH
extern volatile uint16_t AD1CSSH __attribute__((__sfr__));
typedef struct tagAD1CSSHBITS {
  uint16_t :12;
  uint16_t CSS28:1;
  uint16_t CSS29:1;
  uint16_t CSS30:1;
} AD1CSSHBITS;
extern volatile AD1CSSHBITS AD1CSSHbits __attribute__((__sfr__));

#define AD1CSSL AD1CSSL
extern volatile uint16_t AD1CSSL __attribute__((__sfr__));
typedef struct tagAD1CSSLBITS {
  uint16_t CSS0:1;
  uint16_t CSS1:1;
  uint16_t CSS2:1;
  uint16_t CSS3:1;
  uint16_t CSS4:1;
  uint16_t CSS5:1;
  uint16_t CSS6:1;
  uint16_t CSS7:1;
  uint16_t CSS8:1;
  uint16_t CSS9:1;
  uint16_t CSS10:1;
  uint16_t CSS11:1;
  uint16_t CSS12:1;
  uint16_t CSS13:1;
  uint16_t CSS14:1;
  uint16_t CSS15:1;
} AD1CSSLBITS;
