MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA705/mcu.h
/* CNPDB */
#define _IOCPDB0 CNPDBbits.IOCPDB0
#define _IOCPDB1 CNPDBbits.IOCPDB1
#define _IOCPDB2 CNPDBbits.IOCPDB2
#define _IOCPDB3 CNPDBbits.IOCPDB3
#define _IOCPDB4 CNPDBbits.IOCPDB4
#define _IOCPDB5 CNPDBbits.IOCPDB5
#define _IOCPDB6 CNPDBbits.IOCPDB6
#define _IOCPDB7 CNPDBbits.IOCPDB7
#define _IOCPDB8 CNPDBbits.IOCPDB8
#define _IOCPDB9 CNPDBbits.IOCPDB9
#define _IOCPDB10 CNPDBbits.IOCPDB10
#define _IOCPDB11 CNPDBbits.IOCPDB11
#define _IOCPDB12 CNPDBbits.IOCPDB12
#define _IOCPDB13 CNPDBbits.IOCPDB13
#define _IOCPDB14 CNPDBbits.IOCPDB14
#define _IOCPDB15 CNPDBbits.IOCPDB15
#define _CNPDB0 CNPDBbits.CNPDB0
#define _CNPDB1 CNPDBbits.CNPDB1
#define _CNPDB2 CNPDBbits.CNPDB2
#define _CNPDB3 CNPDBbits.CNPDB3
#define _CNPDB4 CNPDBbits.CNPDB4
#define _CNPDB5 CNPDBbits.CNPDB5
#define _CNPDB6 CNPDBbits.CNPDB6
#define _CNPDB7 CNPDBbits.CNPDB7
#define _CNPDB8 CNPDBbits.CNPDB8
#define _CNPDB9 CNPDBbits.CNPDB9
#define _CNPDB10 CNPDBbits.CNPDB10
#define _CNPDB11 CNPDBbits.CNPDB11
#define _CNPDB12 CNPDBbits.CNPDB12
#define _CNPDB13 CNPDBbits.CNPDB13
#define _CNPDB14 CNPDBbits.CNPDB14
#define _CNPDB15 CNPDBbits.CNPDB15

/* TRISC */
#define _TRISC0 TRISCbits.TRISC0
#define _TRISC1 TRISCbits.TRISC1
#define _TRISC2 TRISCbits.TRISC2
#define _TRISC3 TRISCbits.TRISC3
#define _TRISC4 TRISCbits.TRISC4
#define _TRISC5 TRISCbits.TRISC5
#define _TRISC6 TRISCbits.TRISC6
#define _TRISC7 TRISCbits.TRISC7
#define _TRISC8 TRISCbits.TRISC8
#define _TRISC9 TRISCbits.TRISC9

/* PORTC */
#define _RC0 PORTCbits.RC0
#define _RC1 PORTCbits.RC1
#define _RC2 PORTCbits.RC2
#define _RC3 PORTCbits.RC3
#define _RC4 PORTCbits.RC4
#define _RC5 PORTCbits.RC5
#define _RC6 PORTCbits.RC6
#define _RC7 PORTCbits.RC7
#define _RC8 PORTCbits.RC8
#define _RC9 PORTCbits.RC9

/* LATC */
#define _LATC0 LATCbits.LATC0
#define _LATC1 LATCbits.LATC1
#define _LATC2 LATCbits.LATC2
#define _LATC3 LATCbits.LATC3
#define _LATC4 LATCbits.LATC4
#define _LATC5 LATCbits.LATC5
#define _LATC6 LATCbits.LATC6
#define _LATC7 LATCbits.LATC7
#define _LATC8 LATCbits.LATC8
#define _LATC9 LATCbits.LATC9

/* ODCC */
#define _ODCC0 ODCCbits.ODCC0
#define _ODCC1 ODCCbits.ODCC1
#define _ODCC2 ODCCbits.ODCC2
#define _ODCC3 ODCCbits.ODCC3
#define _ODCC4 ODCCbits.ODCC4
#define _ODCC5 ODCCbits.ODCC5
#define _ODCC6 ODCCbits.ODCC6
#define _ODCC7 ODCCbits.ODCC7
#define _ODCC8 ODCCbits.ODCC8
#define _ODCC9 ODCCbits.ODCC9

/* ANSC */
#define _ANSC0 ANSCbits.ANSC0
#define _ANSC1 ANSCbits.ANSC1
#define _ANSC2 ANSCbits.ANSC2
#define _ANSC3 ANSCbits.ANSC3
#define _ANSELC0 ANSCbits.ANSELC0
#define _ANSELC1 ANSCbits.ANSELC1
#define _ANSELC2 ANSCbits.ANSELC2
#define _ANSELC3 ANSCbits.ANSELC3

/* IOCPC */
/* Bitname _IOCPC0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC9 cannot be defined because it is used by more than one SFR */

/* IOCNC */
#define _IOCNC0 IOCNCbits.IOCNC0
#define _IOCNC1 IOCNCbits.IOCNC1
#define _IOCNC2 IOCNCbits.IOCNC2
#define _IOCNC3 IOCNCbits.IOCNC3
#define _IOCNC4 IOCNCbits.IOCNC4
#define _IOCNC5 IOCNCbits.IOCNC5
#define _IOCNC6 IOCNCbits.IOCNC6
#define _IOCNC7 IOCNCbits.IOCNC7
#define _IOCNC8 IOCNCbits.IOCNC8
#define _IOCNC9 IOCNCbits.IOCNC9

/* IOCFC */
#define _IOCFC0 IOCFCbits.IOCFC0
#define _IOCFC1 IOCFCbits.IOCFC1
#define _IOCFC2 IOCFCbits.IOCFC2
#define _IOCFC3 IOCFCbits.IOCFC3
#define _IOCFC4 IOCFCbits.IOCFC4
#define _IOCFC5 IOCFCbits.IOCFC5
#define _IOCFC6 IOCFCbits.IOCFC6
#define _IOCFC7 IOCFCbits.IOCFC7
#define _IOCFC8 IOCFCbits.IOCFC8
#define _IOCFC9 IOCFCbits.IOCFC9

/* CNPUC */
/* Bitname _IOCPC0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC9 cannot be defined because it is used by more than one SFR */
#define _IOCPUC0 CNPUCbits.IOCPUC0
#define _IOCPUC1 CNPUCbits.IOCPUC1
#define _IOCPUC2 CNPUCbits.IOCPUC2
#define _IOCPUC3 CNPUCbits.IOCPUC3
#define _IOCPUC4 CNPUCbits.IOCPUC4
#define _IOCPUC5 CNPUCbits.IOCPUC5
#define _IOCPUC6 CNPUCbits.IOCPUC6
#define _IOCPUC7 CNPUCbits.IOCPUC7
#define _IOCPUC8 CNPUCbits.IOCPUC8
#define _IOCPUC9 CNPUCbits.IOCPUC9
#define _CNPUC0 CNPUCbits.CNPUC0
#define _CNPUC1 CNPUCbits.CNPUC1
#define _CNPUC2 CNPUCbits.CNPUC2
#define _CNPUC3 CNPUCbits.CNPUC3
#define _CNPUC4 CNPUCbits.CNPUC4
#define _CNPUC5 CNPUCbits.CNPUC5
#define _CNPUC6 CNPUCbits.CNPUC6
#define _CNPUC7 CNPUCbits.CNPUC7
#define _CNPUC8 CNPUCbits.CNPUC8
#define _CNPUC9 CNPUCbits.CNPUC9

/* CNPDC */
#define _IOCPDC0 CNPDCbits.IOCPDC0
#define _IOCPDC1 CNPDCbits.IOCPDC1
#define _IOCPDC2 CNPDCbits.IOCPDC2
#define _IOCPDC3 CNPDCbits.IOCPDC3
#define _IOCPDC4 CNPDCbits.IOCPDC4
#define _IOCPDC5 CNPDCbits.IOCPDC5
#define _IOCPDC6 CNPDCbits.IOCPDC6
#define _IOCPDC7 CNPDCbits.IOCPDC7
#define _IOCPDC8 CNPDCbits.IOCPDC8
#define _IOCPDC9 CNPDCbits.IOCPDC9
#define _CNPDC0 CNPDCbits.CNPDC0
#define _CNPDC1 CNPDCbits.CNPDC1
#define _CNPDC2 CNPDCbits.CNPDC2
#define _CNPDC3 CNPDCbits.CNPDC3
#define _CNPDC4 CNPDCbits.CNPDC4
#define _CNPDC5 CNPDCbits.CNPDC5
#define _CNPDC6 CNPDCbits.CNPDC6
#define _CNPDC7 CNPDCbits.CNPDC7
#define _CNPDC8 CNPDCbits.CNPDC8
#define _CNPDC9 CNPDCbits.CNPDC9

/* AD1CON1 */
#define _DONE AD1CON1bits.DONE
#define _SAMP AD1CON1bits.SAMP
#define _ASAM AD1CON1bits.ASAM
#define _SSRC AD1CON1bits.SSRC
#define _FORM AD1CON1bits.FORM
#define _MODE12 AD1CON1bits.MODE12
#define _DMAEN AD1CON1bits.DMAEN
#define _DMABM AD1CON1bits.DMABM
#define _ADSIDL AD1CON1bits.ADSIDL
#define _ADON AD1CON1bits.ADON
#define _SSRC0 AD1CON1bits.SSRC0
#define _SSRC1 AD1CON1bits.SSRC1
#define _SSRC2 AD1CON1bits.SSRC2
#define _SSRC3 AD1CON1bits.SSRC3
#define _FORM0 AD1CON1bits.FORM0
#define _FORM1 AD1CON1bits.FORM1

