MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA705/mcu.h
#define _ODCA_ODCA8_POSITION                     0x00000008
#define _ODCA_ODCA8_MASK                         0x00000100
#define _ODCA_ODCA8_LENGTH                       0x00000001

#define _ODCA_ODCA9_POSITION                     0x00000009
#define _ODCA_ODCA9_MASK                         0x00000200
#define _ODCA_ODCA9_LENGTH                       0x00000001

#define _ODCA_ODCA10_POSITION                    0x0000000A
#define _ODCA_ODCA10_MASK                        0x00000400
#define _ODCA_ODCA10_LENGTH                      0x00000001

#define _ODCA_ODCA11_POSITION                    0x0000000B
#define _ODCA_ODCA11_MASK                        0x00000800
#define _ODCA_ODCA11_LENGTH                      0x00000001

#define _ODCA_ODCA12_POSITION                    0x0000000C
#define _ODCA_ODCA12_MASK                        0x00001000
#define _ODCA_ODCA12_LENGTH                      0x00000001

#define _ODCA_ODCA13_POSITION                    0x0000000D
#define _ODCA_ODCA13_MASK                        0x00002000
#define _ODCA_ODCA13_LENGTH                      0x00000001

#define _ODCA_ODCA14_POSITION                    0x0000000E
#define _ODCA_ODCA14_MASK                        0x00004000
#define _ODCA_ODCA14_LENGTH                      0x00000001

#define _ANSA_ANSA0_POSITION                     0x00000000
#define _ANSA_ANSA0_MASK                         0x00000001
#define _ANSA_ANSA0_LENGTH                       0x00000001

#define _ANSA_ANSA1_POSITION                     0x00000001
#define _ANSA_ANSA1_MASK                         0x00000002
#define _ANSA_ANSA1_LENGTH                       0x00000001

#define _ANSA_ANSA2_POSITION                     0x00000002
#define _ANSA_ANSA2_MASK                         0x00000004
#define _ANSA_ANSA2_LENGTH                       0x00000001

#define _ANSA_ANSA3_POSITION                     0x00000003
#define _ANSA_ANSA3_MASK                         0x00000008
#define _ANSA_ANSA3_LENGTH                       0x00000001

#define _ANSA_ANSELA0_POSITION                   0x00000000
#define _ANSA_ANSELA0_MASK                       0x00000001
#define _ANSA_ANSELA0_LENGTH                     0x00000001

#define _ANSA_ANSELA1_POSITION                   0x00000001
#define _ANSA_ANSELA1_MASK                       0x00000002
#define _ANSA_ANSELA1_LENGTH                     0x00000001

#define _ANSA_ANSELA2_POSITION                   0x00000002
#define _ANSA_ANSELA2_MASK                       0x00000004
#define _ANSA_ANSELA2_LENGTH                     0x00000001

#define _ANSA_ANSELA3_POSITION                   0x00000003
#define _ANSA_ANSELA3_MASK                       0x00000008
#define _ANSA_ANSELA3_LENGTH                     0x00000001

#define _ANSELA_ANSA0_POSITION                   0x00000000
#define _ANSELA_ANSA0_MASK                       0x00000001
#define _ANSELA_ANSA0_LENGTH                     0x00000001

#define _ANSELA_ANSA1_POSITION                   0x00000001
#define _ANSELA_ANSA1_MASK                       0x00000002
#define _ANSELA_ANSA1_LENGTH                     0x00000001

#define _ANSELA_ANSA2_POSITION                   0x00000002
#define _ANSELA_ANSA2_MASK                       0x00000004
#define _ANSELA_ANSA2_LENGTH                     0x00000001

#define _ANSELA_ANSA3_POSITION                   0x00000003
#define _ANSELA_ANSA3_MASK                       0x00000008
#define _ANSELA_ANSA3_LENGTH                     0x00000001

#define _ANSELA_ANSELA0_POSITION                 0x00000000
#define _ANSELA_ANSELA0_MASK                     0x00000001
#define _ANSELA_ANSELA0_LENGTH                   0x00000001

#define _ANSELA_ANSELA1_POSITION                 0x00000001
#define _ANSELA_ANSELA1_MASK                     0x00000002
#define _ANSELA_ANSELA1_LENGTH                   0x00000001

#define _ANSELA_ANSELA2_POSITION                 0x00000002
#define _ANSELA_ANSELA2_MASK                     0x00000004
#define _ANSELA_ANSELA2_LENGTH                   0x00000001

#define _ANSELA_ANSELA3_POSITION                 0x00000003
#define _ANSELA_ANSELA3_MASK                     0x00000008
#define _ANSELA_ANSELA3_LENGTH                   0x00000001

#define _IOCPA_IOCPA0_POSITION                   0x00000000
#define _IOCPA_IOCPA0_MASK                       0x00000001
#define _IOCPA_IOCPA0_LENGTH                     0x00000001

#define _IOCPA_IOCPA1_POSITION                   0x00000001
#define _IOCPA_IOCPA1_MASK                       0x00000002
#define _IOCPA_IOCPA1_LENGTH                     0x00000001

#define _IOCPA_IOCPA2_POSITION                   0x00000002
#define _IOCPA_IOCPA2_MASK                       0x00000004
#define _IOCPA_IOCPA2_LENGTH                     0x00000001

#define _IOCPA_IOCPA3_POSITION                   0x00000003
#define _IOCPA_IOCPA3_MASK                       0x00000008
#define _IOCPA_IOCPA3_LENGTH                     0x00000001

#define _IOCPA_IOCPA4_POSITION                   0x00000004
#define _IOCPA_IOCPA4_MASK                       0x00000010
#define _IOCPA_IOCPA4_LENGTH                     0x00000001

#define _IOCPA_IOCPA7_POSITION                   0x00000007
#define _IOCPA_IOCPA7_MASK                       0x00000080
#define _IOCPA_IOCPA7_LENGTH                     0x00000001

#define _IOCPA_IOCPA8_POSITION                   0x00000008
#define _IOCPA_IOCPA8_MASK                       0x00000100
#define _IOCPA_IOCPA8_LENGTH                     0x00000001

#define _IOCPA_IOCPA9_POSITION                   0x00000009
#define _IOCPA_IOCPA9_MASK                       0x00000200
#define _IOCPA_IOCPA9_LENGTH                     0x00000001

#define _IOCPA_IOCPA10_POSITION                  0x0000000A
#define _IOCPA_IOCPA10_MASK                      0x00000400
#define _IOCPA_IOCPA10_LENGTH                    0x00000001

#define _IOCPA_IOCPA11_POSITION                  0x0000000B
#define _IOCPA_IOCPA11_MASK                      0x00000800
#define _IOCPA_IOCPA11_LENGTH                    0x00000001

#define _IOCPA_IOCPA12_POSITION                  0x0000000C
#define _IOCPA_IOCPA12_MASK                      0x00001000
#define _IOCPA_IOCPA12_LENGTH                    0x00000001

#define _IOCPA_IOCPA13_POSITION                  0x0000000D
#define _IOCPA_IOCPA13_MASK                      0x00002000
#define _IOCPA_IOCPA13_LENGTH                    0x00000001

#define _IOCPA_IOCPA14_POSITION                  0x0000000E
#define _IOCPA_IOCPA14_MASK                      0x00004000
#define _IOCPA_IOCPA14_LENGTH                    0x00000001

#define _IOCNA_IOCNA0_POSITION                   0x00000000
#define _IOCNA_IOCNA0_MASK                       0x00000001
#define _IOCNA_IOCNA0_LENGTH                     0x00000001

