MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA705/mcu.h
#define _ANSELC_ANSC2_POSITION                   0x00000002
#define _ANSELC_ANSC2_MASK                       0x00000004
#define _ANSELC_ANSC2_LENGTH                     0x00000001

#define _ANSELC_ANSC3_POSITION                   0x00000003
#define _ANSELC_ANSC3_MASK                       0x00000008
#define _ANSELC_ANSC3_LENGTH                     0x00000001

#define _ANSELC_ANSELC0_POSITION                 0x00000000
#define _ANSELC_ANSELC0_MASK                     0x00000001
#define _ANSELC_ANSELC0_LENGTH                   0x00000001

#define _ANSELC_ANSELC1_POSITION                 0x00000001
#define _ANSELC_ANSELC1_MASK                     0x00000002
#define _ANSELC_ANSELC1_LENGTH                   0x00000001

#define _ANSELC_ANSELC2_POSITION                 0x00000002
#define _ANSELC_ANSELC2_MASK                     0x00000004
#define _ANSELC_ANSELC2_LENGTH                   0x00000001

#define _ANSELC_ANSELC3_POSITION                 0x00000003
#define _ANSELC_ANSELC3_MASK                     0x00000008
#define _ANSELC_ANSELC3_LENGTH                   0x00000001

#define _IOCPC_IOCPC0_POSITION                   0x00000000
#define _IOCPC_IOCPC0_MASK                       0x00000001
#define _IOCPC_IOCPC0_LENGTH                     0x00000001

#define _IOCPC_IOCPC1_POSITION                   0x00000001
#define _IOCPC_IOCPC1_MASK                       0x00000002
#define _IOCPC_IOCPC1_LENGTH                     0x00000001

#define _IOCPC_IOCPC2_POSITION                   0x00000002
#define _IOCPC_IOCPC2_MASK                       0x00000004
#define _IOCPC_IOCPC2_LENGTH                     0x00000001

#define _IOCPC_IOCPC3_POSITION                   0x00000003
#define _IOCPC_IOCPC3_MASK                       0x00000008
#define _IOCPC_IOCPC3_LENGTH                     0x00000001

#define _IOCPC_IOCPC4_POSITION                   0x00000004
#define _IOCPC_IOCPC4_MASK                       0x00000010
#define _IOCPC_IOCPC4_LENGTH                     0x00000001

#define _IOCPC_IOCPC5_POSITION                   0x00000005
#define _IOCPC_IOCPC5_MASK                       0x00000020
#define _IOCPC_IOCPC5_LENGTH                     0x00000001

#define _IOCPC_IOCPC6_POSITION                   0x00000006
#define _IOCPC_IOCPC6_MASK                       0x00000040
#define _IOCPC_IOCPC6_LENGTH                     0x00000001

#define _IOCPC_IOCPC7_POSITION                   0x00000007
#define _IOCPC_IOCPC7_MASK                       0x00000080
#define _IOCPC_IOCPC7_LENGTH                     0x00000001

#define _IOCPC_IOCPC8_POSITION                   0x00000008
#define _IOCPC_IOCPC8_MASK                       0x00000100
#define _IOCPC_IOCPC8_LENGTH                     0x00000001

#define _IOCPC_IOCPC9_POSITION                   0x00000009
#define _IOCPC_IOCPC9_MASK                       0x00000200
#define _IOCPC_IOCPC9_LENGTH                     0x00000001

#define _IOCNC_IOCNC0_POSITION                   0x00000000
#define _IOCNC_IOCNC0_MASK                       0x00000001
#define _IOCNC_IOCNC0_LENGTH                     0x00000001

#define _IOCNC_IOCNC1_POSITION                   0x00000001
#define _IOCNC_IOCNC1_MASK                       0x00000002
#define _IOCNC_IOCNC1_LENGTH                     0x00000001

#define _IOCNC_IOCNC2_POSITION                   0x00000002
#define _IOCNC_IOCNC2_MASK                       0x00000004
#define _IOCNC_IOCNC2_LENGTH                     0x00000001

#define _IOCNC_IOCNC3_POSITION                   0x00000003
#define _IOCNC_IOCNC3_MASK                       0x00000008
#define _IOCNC_IOCNC3_LENGTH                     0x00000001

#define _IOCNC_IOCNC4_POSITION                   0x00000004
#define _IOCNC_IOCNC4_MASK                       0x00000010
#define _IOCNC_IOCNC4_LENGTH                     0x00000001

#define _IOCNC_IOCNC5_POSITION                   0x00000005
#define _IOCNC_IOCNC5_MASK                       0x00000020
#define _IOCNC_IOCNC5_LENGTH                     0x00000001

#define _IOCNC_IOCNC6_POSITION                   0x00000006
#define _IOCNC_IOCNC6_MASK                       0x00000040
#define _IOCNC_IOCNC6_LENGTH                     0x00000001

#define _IOCNC_IOCNC7_POSITION                   0x00000007
#define _IOCNC_IOCNC7_MASK                       0x00000080
#define _IOCNC_IOCNC7_LENGTH                     0x00000001

#define _IOCNC_IOCNC8_POSITION                   0x00000008
#define _IOCNC_IOCNC8_MASK                       0x00000100
#define _IOCNC_IOCNC8_LENGTH                     0x00000001

#define _IOCNC_IOCNC9_POSITION                   0x00000009
#define _IOCNC_IOCNC9_MASK                       0x00000200
#define _IOCNC_IOCNC9_LENGTH                     0x00000001

#define _IOCFC_IOCFC0_POSITION                   0x00000000
#define _IOCFC_IOCFC0_MASK                       0x00000001
#define _IOCFC_IOCFC0_LENGTH                     0x00000001

#define _IOCFC_IOCFC1_POSITION                   0x00000001
#define _IOCFC_IOCFC1_MASK                       0x00000002
#define _IOCFC_IOCFC1_LENGTH                     0x00000001

#define _IOCFC_IOCFC2_POSITION                   0x00000002
#define _IOCFC_IOCFC2_MASK                       0x00000004
#define _IOCFC_IOCFC2_LENGTH                     0x00000001

#define _IOCFC_IOCFC3_POSITION                   0x00000003
#define _IOCFC_IOCFC3_MASK                       0x00000008
#define _IOCFC_IOCFC3_LENGTH                     0x00000001

#define _IOCFC_IOCFC4_POSITION                   0x00000004
#define _IOCFC_IOCFC4_MASK                       0x00000010
#define _IOCFC_IOCFC4_LENGTH                     0x00000001

#define _IOCFC_IOCFC5_POSITION                   0x00000005
#define _IOCFC_IOCFC5_MASK                       0x00000020
#define _IOCFC_IOCFC5_LENGTH                     0x00000001

#define _IOCFC_IOCFC6_POSITION                   0x00000006
#define _IOCFC_IOCFC6_MASK                       0x00000040
#define _IOCFC_IOCFC6_LENGTH                     0x00000001

#define _IOCFC_IOCFC7_POSITION                   0x00000007
#define _IOCFC_IOCFC7_MASK                       0x00000080
#define _IOCFC_IOCFC7_LENGTH                     0x00000001

#define _IOCFC_IOCFC8_POSITION                   0x00000008
#define _IOCFC_IOCFC8_MASK                       0x00000100
#define _IOCFC_IOCFC8_LENGTH                     0x00000001

#define _IOCFC_IOCFC9_POSITION                   0x00000009
#define _IOCFC_IOCFC9_MASK                       0x00000200
#define _IOCFC_IOCFC9_LENGTH                     0x00000001

#define _CNPUC_IOCPC0_POSITION                   0x00000000
#define _CNPUC_IOCPC0_MASK                       0x00000001
#define _CNPUC_IOCPC0_LENGTH                     0x00000001

